app/models/non_persistent/basket.rb

SELECT "products".* FROM "products" WHERE "products"."code" IN ($1, $2)  [["code", 0], ["code", 2]]
SELECT "products".* FROM "products" WHERE "products"."code" IN ($1, $2)  [["code", "hoodie"], ["code", "hoodie"]]
---
    def self.from_product_codes(product_codes: [])
      selected_codes = (product_codes || []).map(&:to_s)
      selected_products = Product.where(code: product_codes)

      unless valid_product_codes?(product_codes: selected_codes, found_products: selected_products)
        raise Error::Model::Basket::InvalidProductCodesError.new(product_codes: selected_codes,
                                                                 products: selected_products)
      end

      from_products(products: selected_codes.map { |pc| selected_products.find { |p| p.code == pc } })