app/lib/error/model/basket/invalid_product_codes_error.rb

SELECT "products".* FROM "products" WHERE "products"."code" IN ($1, $2)  [["code", 2], ["code", 2]]
---
        def error_message(product_codes: [], products: [])
          wrong_product_codes = product_codes - products.map(&:code)