app/controllers/api/v1/basket_controller.rb

SELECT "products".* FROM "products" WHERE "products"."code" IN ($1, $2)  [["code", 0], ["code", 2]]
---
      def set_basket
        @basket = NonPersistent::Basket.from_product_codes(product_codes: basket_params.map(&:downcase))