app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products" WHERE (lower(name) like '%mug%') ORDER BY created_at desc
---
      def index
        filtered_products = filtered_resources(resources: Product.all)

UPDATE "products" SET "price_cents" = $1, "price_currency" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["price_cents", 10], ["price_currency", "EUR"], ["updated_at", "2022-01-15 18:08:27.268345"], ["id", 1]]
---
      def update
        set_updated_price
        if @product.update(_update_price: @updated_price)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_product
        @product = Product.find(params[:id])