app/models/discount.rb

SELECT "products".* FROM "products" INNER JOIN "product_discounts" ON "products"."id" = "product_discounts"."product_id" WHERE "product_discounts"."discount_id" = $1  [["discount_id", 1]]
---
  def applicable_products(basket:)
    # Select basket products whose code are compatible with discount
    basket_applicable_products =
      products.blank? ? basket.item_products : basket.item_products.select { |p| products.include? p }